slank/esp32-bt/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Use internal USB (native USB on ESP32-S3)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# TinyUSB CDC
CONFIG_TINYUSB_CDC_ENABLED=y

# Bluetooth – controller only (no host stack), BLE only
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY=y

# Increase USB CDC buffers to handle large HCI packets
CONFIG_TINYUSB_CDC_RX_BUFSIZE=512
CONFIG_TINYUSB_CDC_TX_BUFSIZE=512
